Revit 2027 API
FabricationPart.CanASlopeBeApplied Method
 This will test if a slope can be applied to the part and maintain connections with any connected parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanASlopeBeApplied()
Public Function CanASlopeBeApplied As Boolean
public:
bool CanASlopeBeApplied()
member CanASlopeBeApplied : unit -> bool
Return Value
Boolean
 Returns true if the part can be successfully sloped otherwise false.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace